In [ ]:
# install dependencies
%pip install pandas xlrd openpyxl

In [50]:
import pandas as pd

# print dataframe
data = {
    "Name": ["Rose", "John", "Jane", "Mary"],
    "ID": [1, 2, 3, 4],
    "Department": [
        "Architect Group",
        "Software Group",
        "Design Team",
        "Infrastructure",
    ],
    "Salary": [100000, 80000, 50000, 60000],
}

df = pd.DataFrame(data)

# print dataframe
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [21]:
# print dataframe column
id = df[["ID"]]
id

   ID
0   1
1   2
2   3
3   4

In [ ]:
# Retrieving the Department, Salary and ID columns and assigning it to a variable data
data = df[["Department", "Salary", "ID"]]
data

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [23]:
type(data)

pandas.core.frame.DataFrame

In [24]:
# Access the value on the first row and the first column
df.iloc[0, 0]

'Rose'

In [25]:
# Access the value on the first row and the third column
df.iloc[0, 2]

'Architect Group'

In [27]:
# Access the column using the name
df.loc[0, "Salary"]

np.int64(100000)

In [37]:
df2 = df
df2 = df2.set_index("Name")

# display 5 rows of new dataframe
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [38]:
# access the column using the name
df2.loc["Jane", "Salary"]

np.int64(50000)

In [42]:
# slicing
df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [ ]:
# slicing
df.loc[0:2, "ID":"Department"]

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [45]:
# slicing by name index
df2.loc["Rose":"Jane", "ID":"Department"]

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

In [ ]:
# read csv file
df = pd.read_csv("product_sales.csv")
df

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [54]:
# read excel file
df = pd.read_excel("product_sales.xlsx")
df

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [57]:
q = df[["Quantity"]]
q

   Quantity
0         2
1         3
2         5
3        10
4         1

In [59]:
type(q)

pandas.core.frame.DataFrame

In [ ]:
# Get the column as a series with single brackets

p = df["Product"]
p

0        Laptop
1    Smartphone
2    Desk Chair
3      Notebook
4       Monitor
Name: Product, dtype: object

In [60]:
type(p)

pandas.core.series.Series

In [61]:
multiple = df[["Product", "Category", "Quantity"]]
multiple

      Product     Category  Quantity
0      Laptop  Electronics         2
1  Smartphone  Electronics         3
2  Desk Chair    Furniture         5
3    Notebook   Stationery        10
4     Monitor  Electronics         1